---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FilledRegionFailures.BadViewType
source: html/d8809a1e-faa8-011b-d4a2-50f84fb9fc5c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FilledRegionFailures.BadViewType Property

[Filled Region Name] can't be placed in 3D Views.

## Syntax (C#)
```csharp
public static FailureDefinitionId BadViewType { get; }
```